Repository: Spacebody/Vela
Catalog: Vela/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# overview.controller.offline
source: Controller offline
zh_hans: Controller 离线

# overview.core.blocked.title
source: Critical: Active Core Blocked
zh_hans: 严重：活跃内核已被阻止

# overview.core.blockedFormat
source: Mihomo %@ · Critical: Blocked
zh_hans: Mihomo %@ · 严重：已阻止

# overview.core.factoryFormat
source: Mihomo %@ · Factory
zh_hans: Mihomo %@ · 内置

# overview.core.probationFormat
source: Mihomo %@ · Probation
zh_hans: Mihomo %@ · 观察期

# overview.core.verifiedFormat
source: Verified · %@
zh_hans: 已验证 · %@

# overview.latency.notTested
source: Not tested
zh_hans: 未测试

# overview.mode.availableAfterStart
source: Available after Mihomo starts.
zh_hans: Mihomo 启动后可用。

# overview.mode.title
source: Mihomo Mode
zh_hans: Mihomo 模式

# overview.profile.choose
source: Choose a profile before starting Mihomo.
zh_hans: 启动 Mihomo 前请选择配置。

# overview.profile.localYAML
source: Local YAML
zh_hans: 本地 YAML

# overview.profile.notSelected
source: Not selected
zh_hans: 未选择

# overview.profile.remoteSubscription
source: Remote subscription
zh_hans: 远程订阅

# overview.proxy.empty.connected
source: The active profile does not expose a visible proxy group.
zh_hans: 当前配置未提供可见的代理组。

# overview.proxy.empty.connecting
source: Waiting for the Mihomo Controller to publish its proxy catalog.
zh_hans: 正在等待 Mihomo Controller 发布代理目录。

# overview.proxy.empty.disconnected
source: Start Mihomo to inspect the active proxy group.
zh_hans: 启动 Mihomo 以查看活跃代理组。

# overview.proxy.empty.title
source: No proxy group
zh_hans: 无代理组

# overview.proxy.noSelection
source: No selection
zh_hans: 未选择

# overview.proxyGroup.title
source: Proxy Group
zh_hans: 代理组

# overview.quickActions.title
source: Quick Actions
zh_hans: 快捷操作

# overview.scenes.loading
source: Scene state is loading.
zh_hans: 正在载入场景状态。

# overview.summary.controllerConnecting
source: Mihomo is running while Vela waits for its Controller.
zh_hans: Mihomo 正在运行，Vela 正在等待 Controller。

# overview.summary.degraded
source: Mihomo is running, but one or more checks need attention.
zh_hans: Mihomo 正在运行，但一项或多项检查需要处理。

# overview.summary.failed
source: Mihomo is unavailable. Review the latest error before retrying.
zh_hans: Mihomo 不可用。请检查最新错误后再重试。

# overview.summary.healthy
source: Mihomo, its Controller, mixed port, and Internet checks are healthy.
zh_hans: Mihomo、Controller、混合端口和互联网检查均正常。

# overview.summary.recovering
source: Checking whether the engine can recover.
zh_hans: 正在检查引擎能否恢复。

# overview.summary.starting
source: Launching the managed Mihomo process.
zh_hans: 正在启动由 Vela 管理的 Mihomo 进程。

# overview.summary.stopped
source: Select a profile, validate it, then start Mihomo.
zh_hans: 选择配置、进行验证，然后启动 Mihomo。

# overview.summary.stopping
source: Stopping streams and the process started by Vela.
zh_hans: 正在停止数据流以及由 Vela 启动的进程。

# overview.summary.validating
source: Checking the generated runtime configuration.
zh_hans: 正在检查生成的运行时配置。

# overview.systemProxy.controllerHelp
source: Wait for the Mihomo Controller to connect.
zh_hans: 请等待 Mihomo Controller 连接。

# overview.systemProxy.enableHelp
source: Route HTTP, HTTPS, and SOCKS through Vela's managed Mihomo port.
zh_hans: 通过 Vela 管理的 Mihomo 端口转发 HTTP、HTTPS 和 SOCKS。

# overview.systemProxy.restoreHelp
source: Restore the system proxy settings that existed before Vela enabled them.
zh_hans: 恢复 Vela 启用系统代理前的设置。

# overview.systemProxy.startHelp
source: Start Mihomo before enabling the system proxy.
zh_hans: 启用系统代理前请先启动 Mihomo。

# overview.traffic.connecting
source: Connecting
zh_hans: 正在连接

# overview.traffic.download
source: Download
zh_hans: 下载

# overview.traffic.lastSample
source: Last sample
zh_hans: 上次采样

# overview.traffic.live
source: Live
zh_hans: 实时

# overview.traffic.noSample
source: No sample
zh_hans: 无采样

# overview.traffic.sessionTotal
source: Session Total
zh_hans: 会话总量

# overview.traffic.title
source: Live Traffic
zh_hans: 实时流量

# overview.traffic.upload
source: Upload
zh_hans: 上传

# overview.transition.title
source: Changing network backend
zh_hans: 正在切换网络后端

# overview.validation.failed.detail
source: Mihomo rejected the generated runtime configuration.
zh_hans: Mihomo 拒绝了生成的运行时配置。

# overview.validation.failed.title
source: Profile validation failed
zh_hans: 配置验证失败

# overview.validation.lineFormat
source: Line %lld: %@
zh_hans: 第 %lld 行：%@

# permission.action.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# permission.education.card.accessibility.format
source: %@. Not requested during onboarding. %@
zh_hans: %@。引导期间不会请求。%@

# permission.education.data
source: Data used
zh_hans: 使用的数据

# permission.education.help
source: Help
zh_hans: 帮助

# permission.education.notNow
source: Not Now
zh_hans: 暂不

# permission.education.revoke
source: How to revoke access
zh_hans: 如何撤销访问

# permission.education.status.format
source: Current status: %@
zh_hans: 当前状态：%@

# permission.education.when
source: When it is used
zh_hans: 使用时机

# permission.education.why
source: Why Vela asks
zh_hans: Vela 为什么请求

# permission.login.action
source: Review Login Item
zh_hans: 检查登录项

# permission.login.data
source: No personal data. macOS records whether Vela is allowed to launch.
zh_hans: 不使用个人数据。macOS 只会记录是否允许 Vela 启动。

# permission.login.revoke
source: Turn it off in Vela or in System Settings > General > Login Items.
zh_hans: 在 Vela 中将其关闭，或前往“系统设置 > 通用 > 登录项”关闭。

# permission.login.title
source: Launch at Login
zh_hans: 登录时启动

# permission.login.when
source: Only after you turn on Launch at Login in Settings.
zh_hans: 仅在你于设置中打开“登录时启动”后使用。

# permission.login.why
source: Launch at Login can make Vela available after you sign in.
zh_hans: 登录时启动可让 Vela 在你登录后保持可用。

# permission.ssid.action
source: Review SSID Access
zh_hans: 检查 SSID 访问权限

# permission.ssid.data
source: Only the network name you choose for an SSID automation rule.
zh_hans: 仅使用你为 SSID 自动化规则选择的网络名称。

# permission.ssid.revoke
source: Remove the SSID rule, then revoke Location access for Vela in System Settings.
zh_hans: 移除 SSID 规则，然后在系统设置中撤销 Vela 的定位访问权限。

# permission.ssid.title
source: Wi-Fi Network Name
zh_hans: Wi-Fi 网络名称

# permission.ssid.when
source: Only while creating an SSID-based rule and after you request access.
zh_hans: 仅在创建基于 SSID 的规则且你主动请求访问后使用。

# permission.ssid.why
source: macOS protects the current Wi-Fi name as location-related information.
zh_hans: macOS 将当前 Wi-Fi 名称作为与定位相关的信息进行保护。

# permission.status.available
source: Available
zh_hans: 可用

# permission.status.denied
source: Blocked in System Settings
zh_hans: 已在系统设置中阻止

# permission.status.enabled
source: Enabled
zh_hans: 已启用

# permission.status.notRequested
source: Not requested
zh_hans: 未请求

# permission.status.requiresApproval
source: Approval required
zh_hans: 需要批准

# permission.status.unavailable
source: Unavailable
zh_hans: 不可用

# permission.tun.action
source: Review TUN Setup
zh_hans: 检查 TUN 设置

# permission.tun.data
source: Vela configures a local network interface and routing rules. It does not request your credentials here.
zh_hans: Vela 会配置本地网络接口和路由规则。此处不会请求你的凭据。

# permission.tun.revoke
source: Disable TUN in Vela. You can also review privileged components in System Settings.
zh_hans: 在 Vela 中关闭 TUN。你也可以在系统设置中检查特权组件。

# permission.tun.title
source: TUN Mode
zh_hans: TUN 模式

# permission.tun.when
source: Only after you explicitly choose to enable TUN and confirm the system prompt.
zh_hans: 仅在你明确选择启用 TUN 并确认系统提示后使用。

# permission.tun.why
source: TUN can route apps that do not follow the macOS system proxy.
zh_hans: TUN 可以路由不遵循 macOS 系统代理设置的应用。

# policy.accessibility.title
source: Accessibility
zh_hans: 辅助功能

# policy.loading
source: Loading Policy
zh_hans: 正在载入政策

# policy.privacy.title
source: Privacy Policy
zh_hans: 隐私政策

# policy.security.title
source: Security Policy
zh_hans: 安全政策

# policy.support.title
source: Support Policy
zh_hans: 支持政策

source: Policy Unavailable
zh_hans: 政策不可用

# profiles.action.openWorkbench
source: Open in Workbench
zh_hans: 在配置工作台中打开

# profiles.action.setActive
source: Set Active
zh_hans: 设为使用中

# profiles.action.setActive.disabled
source: Stop Mihomo and wait for the current operation to finish.
zh_hans: 请停止 Mihomo，并等待当前操作完成。

# profiles.action.setActive.help
source: Use this profile for the next runtime start.
zh_hans: 下次启动运行时使用此配置。

# profiles.action.validate.help
source: Validate the active profile with the existing runtime transaction.
zh_hans: 使用现有运行时事务校验当前使用的配置。

# profiles.action.validate.inactive
source: Set the selected profile active before validating it here.
zh_hans: 请先将所选配置设为使用中，再在此处校验。

# profiles.actions.credentialsProtected.description
source: Changes keep subscription credentials protected in Keychain.
zh_hans: 更改会将订阅凭据安全地保存在钥匙串中。

# profiles.actions.engineRunning.description
source: Stop Mihomo before deleting or replacing profile files.
zh_hans: 请先停止 Mihomo，再删除或替换配置文件。

# profiles.actions.title
source: Actions
zh_hans: 操作

# profiles.add.action
source: Add Configuration…
zh_hans: 添加配置…

# profiles.add.local.action
source: Import Local YAML…
zh_hans: 导入本地 YAML…

# profiles.add.subscription.action
source: Add Subscription…
zh_hans: 添加订阅…

# profiles.authentication.basic
source: Basic
zh_hans: 基本认证

# profiles.authentication.keepExisting
source: Keep Existing
zh_hans: 保留现有设置

# profiles.authentication.none
source: None
zh_hans: 无

# profiles.authentication.remove
source: Remove Authentication
zh_hans: 移除认证

# profiles.authentication.replaceBasic
source: Replace Basic Credentials
zh_hans: 替换基本认证凭据

# profiles.authentication.replaceBearer
source: Replace Bearer Token
zh_hans: 替换 Bearer 令牌

# profiles.configuration.diff.empty.description
source: The effective configuration matches upstream values for managed fields.
zh_hans: 对于受管理的字段，有效配置与上游值一致。

# profiles.configuration.diff.empty.title
source: No Configuration Changes
zh_hans: 配置没有变化

# profiles.configuration.effective.title
source: Effective Configuration
zh_hans: 有效配置

# profiles.configuration.invalid.title
source: Configuration Invalid
zh_hans: 配置无效

# profiles.configuration.mode.diff
source: Diff
zh_hans: 差异

# profiles.configuration.mode.effective
source: Effective
zh_hans: 有效

# profiles.configuration.mode.raw
source: Raw
zh_hans: 原始

# profiles.configuration.notDownloaded
source: No configuration has been downloaded yet.
zh_hans: 尚未下载任何配置。

# profiles.configuration.preview.building
source: Building the merged, redacted preview…
zh_hans: 正在生成合并后且已脱敏的预览…

# profiles.configuration.raw.title
source: Raw Configuration
zh_hans: 原始配置

# profiles.configuration.subtitle
source: Raw source and Vela's redacted effective output
zh_hans: 原始来源与 Vela 已脱敏的有效输出

# profiles.configuration.title
source: Configuration
zh_hans: 配置

# profiles.delete.activeWarning
source: Deleting the active profile clears the runtime selection. Choose another profile before starting Mihomo again.
zh_hans: 删除当前使用的配置会清除运行时选择。再次启动 Mihomo 前，请先选择其他配置。

# profiles.empty.description
source: Import a local YAML file or add a remote subscription.
zh_hans: 导入本地 YAML 文件，或添加远程订阅。

# profiles.empty.title
source: No Configurations Yet
zh_hans: 还没有配置

# profiles.overview.created
source: Created
zh_hans: 创建时间

# profiles.overview.fileName
source: File Name
zh_hans: 文件名

# profiles.overview.profileSize
source: Profile Size
zh_hans: 配置大小

# profiles.overview.source
source: Source
zh_hans: 来源

# profiles.overview.status
source: Status
zh_hans: 状态

# profiles.overview.subtitle
source: Confirmed profile metadata and current runtime selection
zh_hans: 已确认的配置元数据和当前运行时选择

# profiles.overview.title
source: Overview
zh_hans: 概览

# profiles.overview.updated
source: Updated
zh_hans: 更新时间

# profiles.revisions.count.format
source: %lld protected local snapshots
zh_hans: %lld 个受保护的本地快照

# profiles.revisions.currentFrom.format
source: Current from %@
zh_hans: 当前版本来自 %@

# profiles.revisions.none
source: No stored revision
zh_hans: 没有已存储的修订版本

# profiles.revisions.nonePlural
source: No stored revisions
zh_hans: 没有已存储的修订版本

# profiles.revisions.title
source: Revisions
zh_hans: 修订版本

# profiles.schedule.custom
source: Custom
zh_hans: 自定义

# profiles.schedule.daily
source: Daily
zh_hans: 每天

# profiles.schedule.everyMinutes.format
source: Every %lld minutes
zh_hans: 每 %lld 分钟

# profiles.schedule.everySixHours
source: Every 6 hours
zh_hans: 每 6 小时

# profiles.schedule.everyTwelveHours
source: Every 12 hours
zh_hans: 每 12 小时

# profiles.schedule.hourly
source: Hourly
zh_hans: 每小时

# profiles.selection.empty.description
source: Choose a profile to inspect its source, updates, usage, revisions, and effective configuration.
zh_hans: 选择一个配置，以检查其来源、更新、用量、修订版本和有效配置。

# profiles.selection.empty.title
source: Select a Profile
zh_hans: 选择配置

# profiles.source.remoteSubscription
source: Remote subscription
zh_hans: 远程订阅

# profiles.status.activating
source: Activating
zh_hans: 正在设为使用中

# profiles.status.active
source: Active
zh_hans: 使用中

# profiles.status.applying
source: Applying
zh_hans: 正在应用

# profiles.status.checking
source: Checking
zh_hans: 正在检查

# profiles.status.current
source: Current
zh_hans: 当前

# profiles.status.downloading
source: Downloading
zh_hans: 正在下载

# profiles.status.inactive
source: Inactive
zh_hans: 未使用

# profiles.status.local
source: Local
zh_hans: 本地

# profiles.status.remote
source: Remote
zh_hans: 远程

# profiles.status.rollingBack
source: Rolling Back
zh_hans: 正在回滚

# profiles.status.updated
source: Updated
zh_hans: 已更新

# profiles.status.updateFailed
source: Update Failed
zh_hans: 更新失败

# profiles.status.validating
source: Validating
zh_hans: 正在验证

# profiles.status.verifying
source: Verifying
zh_hans: 正在核验

# profiles.subscription.add.subtitle
source: Configure the subscription source and update behavior.
zh_hans: 配置订阅源与更新行为。

# profiles.subscription.add.title
source: Add Remote Subscription
zh_hans: 添加远程订阅

# profiles.subscription.allowInvalidTLS
source: Allow invalid TLS certificates
zh_hans: 允许无效的 TLS 证书

# profiles.subscription.conversion
source: Conversion
zh_hans: 转换

# profiles.subscription.conversionWarningsFormat
source: Conversion Warnings (%lld)
zh_hans: 转换警告（%lld）

# profiles.subscription.convertedLocally
source: Converted locally on this Mac
zh_hans: 已在此 Mac 上本地转换

# profiles.subscription.creating
source: Adding subscription
zh_hans: 正在添加订阅

# profiles.subscription.detectedFormat
source: Detected Format
zh_hans: 检测到的格式

# profiles.subscription.disabled
source: Off
zh_hans: 关闭

# profiles.subscription.edit.title
source: Edit Remote Subscription
zh_hans: 编辑远程订阅

# profiles.subscription.editFailed
source: The subscription changes could not be saved.
zh_hans: 无法保存订阅设置。

# profiles.subscription.enabled
source: On
zh_hans: 开启

# profiles.subscription.ignoredItems
source: Ignored Items
zh_hans: 已忽略项目

# profiles.subscription.ignoreInvalidNodes
source: Ignore invalid nodes and continue
zh_hans: 忽略无效节点并继续

# profiles.subscription.importedNodes
source: Imported Nodes
zh_hans: 已导入节点

# profiles.subscription.invalidTLSWarning
source: This weakens transport security and should only be used for a trusted private provider.
zh_hans: 这会削弱传输安全性，仅应对受信任的私有提供方使用。

# profiles.subscription.lastChecked
source: Last Checked
zh_hans: 上次检查

# profiles.subscription.lastSuccess
source: Last Success
zh_hans: 上次成功

# profiles.subscription.lastUpdateFailed
source: Last Update Failed
zh_hans: 上次更新失败

# profiles.subscription.nextUpdate
source: Next Update
zh_hans: 下次更新

# profiles.subscription.proxyMode
source: Download using
zh_hans: 下载方式

# profiles.subscription.proxyMode.direct
source: Direct
zh_hans: 直连

# profiles.subscription.proxyMode.system
source: System Proxy
zh_hans: 系统代理

# profiles.subscription.proxyMode.vela
source: Vela Proxy
zh_hans: Vela 代理

# profiles.subscription.redactionNotice
source: Sensitive URL fields remain redacted
zh_hans: 敏感 URL 字段保持脱敏

# profiles.subscription.removeDuplicateNodes
source: Remove duplicate nodes
zh_hans: 移除重复节点

# profiles.subscription.renameDuplicateNodes
source: Rename duplicate node names
zh_hans: 重命名重复节点名称

# profiles.subscription.requestTimeoutFormat
source: Request timeout: %lld seconds
zh_hans: 请求超时：%lld 秒

# profiles.subscription.saveAndUpdate
source: Save & Update
zh_hans: 保存并更新

# profiles.subscription.schedule
source: Schedule
zh_hans: 计划

# profiles.subscription.serverInterval
source: Server Interval
zh_hans: 服务器更新间隔

# profiles.subscription.suggestedName
source: Server Name
zh_hans: 服务器名称

# profiles.subscription.title
source: Subscription
zh_hans: 订阅

# profiles.subscription.webPage
source: Account Page
zh_hans: 账户页面

# profiles.usage.available
source: Available
zh_hans: 可用

# profiles.usage.dataUsed
source: Data Used
zh_hans: 已用流量

# profiles.usage.expires.format
source: Expires %@
zh_hans: 到期时间 %@

# profiles.usage.limitReached
source: Limit Reached
zh_hans: 已达上限

# profiles.usage.ofTotalWithPercentage.format
source: of %@ · %@
zh_hans: 总计 %@ · %@

# profiles.usage.title
source: Usage
zh_hans: 用量

# profiles.usage.totalUnavailable
source: The provider did not report a total quota.
zh_hans: 供应商未报告总配额。

# profiles.usage.used.format
source: Used %@
zh_hans: 已用 %@

# profiles.usage.usedOfTotal.format
source: Used %@ of %@
zh_hans: 已用 %@，总计 %@

# providers.action.copySummary
source: Copy Redacted Technical Summary
zh_hans: 复制脱敏技术摘要

# providers.action.openConfiguration
source: Open Configuration
zh_hans: 打开配置

# providers.action.openProxies
source: Open in Proxies
zh_hans: 在代理节点中打开

# providers.action.openRules
source: Open in Rules
zh_hans: 在规则中打开

# providers.action.updateNow
source: Update Now
zh_hans: 立即更新

# providers.availability.loaded
source: Loaded
zh_hans: 已载入

# providers.batch.attention.title
source: Some Providers Need Attention
zh_hans: 部分供应商需要处理

# providers.batch.complete.status
source: Complete
zh_hans: 已完成

# providers.batch.completed.title
source: Batch Completed
zh_hans: 批量操作已完成

# providers.batch.failed.title
source: Failed
zh_hans: 失败

# providers.batch.failure.alreadyRunning
source: Already running
zh_hans: 操作正在运行

# providers.batch.failure.healthCheckFailed
source: Health check failed
zh_hans: 健康检查失败

# providers.batch.failure.providerMissing
source: Provider missing
zh_hans: 供应商不存在

# providers.batch.failure.refreshFailed
source: Refresh failed
zh_hans: 刷新失败

# providers.batch.failure.responseUnreadable
source: Response unreadable
zh_hans: 无法读取响应

# providers.batch.failure.unsupported
source: Unsupported
zh_hans: 不支持

# providers.batch.failure.updateFailed
source: Update failed
zh_hans: 更新失败

# providers.batch.failure.updateInProgress
source: Vela update in progress
zh_hans: Vela 正在更新

# providers.batch.none.status
source: None
zh_hans: 无

# providers.batch.notStarted.status
source: Not Started
zh_hans: 尚未开始

# providers.batch.result.failed
source: Failed
zh_hans: 失败

# providers.batch.result.notStarted
source: Not started
zh_hans: 尚未开始

# providers.batch.result.refreshToVerify
source: Refresh to verify
zh_hans: 刷新以验证

# providers.batch.result.skipped
source: Skipped
zh_hans: 已跳过

# providers.batch.result.succeeded
source: Succeeded
zh_hans: 成功

# providers.batch.result.unknown
source: Result Unknown
zh_hans: 结果未知

# providers.batch.results.title
source: Results
zh_hans: 结果

# providers.batch.retry.status
source: Retry
zh_hans: 重试

# providers.batch.retryFailed
source: Retry Failed
zh_hans: 重试失败项

# providers.batch.skipped.title
source: Skipped
zh_hans: 已跳过

# providers.batch.succeeded.title
source: Succeeded
zh_hans: 成功

# providers.batch.summary.format
source: %lld succeeded, %lld failed, and %lld skipped.
zh_hans: 成功 %1$lld 项，失败 %2$lld 项，跳过 %3$lld 项。

# providers.column.items
source: Items
zh_hans: 项目

# providers.column.kind
source: Kind
zh_hans: 类型

# providers.column.lastUpdate
source: Last Update
zh_hans: 上次更新

# providers.column.nextUpdate
source: Next Update
zh_hans: 下次更新

# providers.column.provider
source: Provider
zh_hans: 供应商

# providers.column.source
source: Source / Vehicle
zh_hans: 来源 / 载体

# providers.context.activeConfiguration
source: Active Configuration
zh_hans: 当前配置

# providers.context.runtime
source: Runtime Catalog
zh_hans: 运行时目录

# providers.count.filtered.format
source: %lld of %lld Providers
zh_hans: %1$lld / %2$lld 个供应商

# providers.count.format
source: %lld Providers
zh_hans: %lld 个供应商

# providers.empty.description
source: The active configuration does not define any proxy or rule providers.
zh_hans: 当前配置未定义任何代理或规则供应商。

# providers.empty.failure.description
source: Start Mihomo or reconnect the Controller, then refresh this page.
zh_hans: 启动 Mihomo 或重新连接 Controller，然后刷新此页面。

# providers.empty.failure.title
source: Provider Data Is Temporarily Unavailable
zh_hans: 供应商数据暂不可用

# providers.empty.filter.description
source: The active catalog contains providers of another kind.
zh_hans: 当前目录包含其他类型的供应商。

# providers.empty.filter.title
source: No Providers in This Filter
zh_hans: 此筛选中没有供应商

# providers.empty.proxy.description
source: This configuration contains rule providers, but no proxy providers.
zh_hans: 当前配置包含规则供应商，但没有代理供应商。

# providers.empty.proxy.title
source: No Proxy Providers
zh_hans: 没有代理供应商

# providers.empty.rule.description
source: This configuration contains proxy providers, but no rule providers.
zh_hans: 当前配置包含代理供应商，但没有规则供应商。

# providers.empty.rule.title
source: No Rule Providers
zh_hans: 没有规则供应商

# providers.empty.showProxyProviders
source: Show Proxy Providers
zh_hans: 显示代理供应商

# providers.empty.showRuleProviders
source: Show Rule Providers
zh_hans: 显示规则供应商

# providers.empty.title
source: No Providers
zh_hans: 没有供应商

# providers.error.cancelledBeforeStart
source: The queued provider operation was cancelled before it started.
zh_hans: 排队中的供应商操作已在开始前取消。

# providers.error.cancelledResultUnknown
source: Vela stopped waiting, but Mihomo may have completed the provider operation. Refresh to verify.
zh_hans: Vela 已停止等待，但 Mihomo 可能已完成供应商操作。请刷新以验证。

# providers.error.decodeFailed
source: Mihomo returned provider data Vela could not read.
zh_hans: Mihomo 返回的供应商数据无法由 Vela 读取。

# providers.error.fetchFailed
source: Mihomo did not return the provider catalog.
zh_hans: Mihomo 未返回供应商目录。

# providers.error.healthCheckFailed
source: The provider health check failed.
zh_hans: 供应商健康检查失败。

# providers.error.operationAlreadyRunning
source: An operation for this provider is already running.
zh_hans: 此供应商已有操作正在运行。

# providers.error.providerNotFound
source: The selected provider no longer exists.
zh_hans: 所选供应商已不存在。

# providers.error.title
source: Provider Operation Failed
zh_hans: 供应商操作失败

# providers.error.unsupportedOperation
source: This provider does not support the requested operation.
zh_hans: 此供应商不支持请求的操作。

# providers.error.updateFailed
source: One or more provider updates failed. Review the batch summary and retry.
zh_hans: 一个或多个供应商更新失败。请查看批量操作摘要并重试。

# providers.error.updateInProgress
source: Provider changes are paused while Vela prepares or recovers an update.
zh_hans: Vela 准备或恢复更新时，供应商更改会暂停。

# providers.filter.all
source: All
zh_hans: 全部

# providers.filter.help
source: Filter providers by kind
zh_hans: 按类型筛选供应商

# providers.filter.proxy
source: Proxy
zh_hans: 代理

# providers.filter.rule
source: Rule
zh_hans: 规则

# providers.filter.showAll
source: Show All
zh_hans: 显示全部

# providers.filter.unavailable.help
source: Provider filters are available after a provider snapshot is loaded.
zh_hans: 加载供应商快照后即可使用类型筛选。

# providers.freshness.current
source: Current
zh_hans: 当前

# providers.freshness.failed
source: Last Update Failed
zh_hans: 上次更新失败

# providers.freshness.unknown
source: Not Reported
zh_hans: 未报告

# providers.freshness.updating
source: Updating
zh_hans: 正在更新

# providers.health.failed
source: Failed
zh_hans: 失败

# providers.health.healthy
source: Healthy
zh_hans: 健康

# providers.health.unknown
source: Unknown
zh_hans: 未知

# providers.inspector.availability
source: Availability
zh_hans: 可用性

# providers.inspector.context
source: Source Context
zh_hans: 来源上下文
